[
   {
    "name": "Raymond Schwartz",
    "title": "Accessibility Engineer",
    "company": "E*Trade",
    "content": "<p>During our two years together, I always looked forward to collaborating with Ryan since he challenged me to do my best work. Ryan's depth of knowledge, tenacious research, and detail-oriented thinking always made for a learning opportunity, good debate, and led to making well-designed products.</p><p>You can always count on Ryan's keen observations to uncover issues and he always offers creative solutions to address his findings. Ryan is a team-player, taking time to help colleagues whether they're struggling with devops or need some advice on CSS best practices-he's always willing to help. Ryan would be a great addition to any team in many capacities. Working with him is one of the things I miss most about not being at E-Trade.</p>",
    "published": true
  },
  {
    "name": "Damien Mase",
    "title": "CEO/Founder",
    "company": "Muscle & Strength",
    "content": "<p>I hired Ryan in March of 2014 as our first in-house Front-end Ul/UX Developer. He was tasked with creating the first responsive design for Muscleandstrengthcom. His knowledge and understanding of how to build a website that works optimally on multiple screen sizes was immediately apparent. Working within a strict time frame, Ryan delivered and exceptional product which exceeded our expectations.</p><p>Over the past 3 years working with Ryan he's been able to demonstrate his talent for creating visually appealing designs with user experience in mind. His knowledge of design software is outstanding and he's been able to take direction from myself and other team members to take an idea from concept to deployment.</p><p>During Ryan's employment he's worked with several internal and external teams on design and user experience projects. He's been able to communicate well and effectively gather information from others to deliver a ﬁnished product that meets the project specifications.</p><p>Without a doubt, I think Ryan would be an asset as a Frontend Ul/UX Designer to any development team.</p>",
    "published": true
  },
  {
    "name": "David Cohen",
    "title": "Marketing Director",
    "company": "CollegePlus",
    "content": "<p>Ryan has been absolutely wonderful to work with. He's got raw artistic talent that's rarely seen. Ryan's unique because he's got a keen eye for design while possessing the technical expertise to use the tools needed to bring that design to life.</p><p>Ryan brings tremendous value by being diverse and agile with his artistic, design, and technical abilities — he can set up a shoot, film it, and produce it. He takes beautiful pictures, creates beautiful landing pages for the web, logos, you name it.</p><p>I appreciate Ryan's strong work ethic, can-do attitude, dedication to producing high-quality work, and the positive, upbeat spirit he brings to every project.</p><p>As a demanding marketer, I settle for nothing but the best, and I expect nothing but stellar results, and Ryan has met this standard. I give him my highest recommendation.</p>",
    "published": false
  },
  {
    "name": "Amber Gonzales",
    "title": "Lead Designer",
    "company": "Amplified Digital",
    "content": "<p>Ryan's talents really shined bright with a new growing company. His innovative ideas and experience really help to set new standards and improve techniques for his field.</p><p>He has been an absolute pleasure to work with. Ryan is a great team player and is always willing to help those who are willing to learn.</p><p>Ryan's multiple skills and experiences just show how great of an employee he is. He is extremely motivated, goal orientated, has a positive attitude, and is always looking to set the bar high to give the best possible in every thing he does.</p>",
    "published": false
  },
  {
    "name": "Gabriela Barnett",
    "title": "Today's Deal Specialist",
    "company": "Amplified Digital",
    "content": "<p>Even though I have only had the pleasure of knowing Ryan for the last 10 months he has been absolutely wonderful to work with. </p><p>Ryan is extremely talented in many aspects of design including, web development, photography, and video. He goes above and beyond to provide the highest standard of work for his customers. </p><p>Ryan is not only a great colleague but a great friend as well. On many occasions Ryan has selflessly taken time out of his day to teach me new and interesting ways to improve my own work. </p><p>Ryan brings an upbeat and positive attitude to our workplace. Any company would benefit greatly from hiring him.</p>",
    "published": false
  },
  {
    "name": "Luke Macias",
    "title": "Founder & President",
    "company": "Macias Strategies",
    "content": "<p>Ryan is a talented logo, web, and print designer. He works very well with everyone at the table and if you use him you'll be very satisfied with the end result.</p>",
    "published": false
  },
  {
    "name": "Connie Burns",
    "title": "Office Manager",
    "company": "Plastic Surgery Specialists",
    "content": "<p>It is with pleasure that I write this letter of recommendation on behalf of Mr. Ryan Menner. In my experiences with Ryan, I have always found him to be extremely professional, pleasant to work with and self-motivated.</p><p>He ensures technical support is available to us both by phone contact and on site, and is committed to finding solutions for a variety of office equipment and computer software or hardware issues.  He is also very knowledgeable in computer graphics and actually put together our office brochure and designed some of our marketing specials for use in our office and on our website.</p><p>Ryan has also been helpful in assisting with our photo studio and imaging system, both with the software and the actual camera function itself.</p>",
    "published": false
  }
]
